### Infrastructure
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
googleplay_user.oliver: Refreshing state... [name=developers/5166846112789481453/users/mail@oliverbinns.info]
googleplay_user.service_account: Refreshing state... [name=developers/5166846112789481453/users/google-play-console@seraphic-elixir-305011.iam.gserviceaccount.com]
googleplay_user.example: Refreshing state... [name=developers/5166846112789481453/users/example@oliverbinns.info]
github_repository.public["terraform-provider-googleplay"]: Refreshing state... [id=terraform-provider-googleplay]
github_repository.public["terraform-provider-appstore"]: Refreshing state... [id=terraform-provider-appstore]
github_repository.public["appstore-go"]: Refreshing state... [id=appstore-go]
github_repository.public["Website"]: Refreshing state... [id=Website]
github_repository.public["app-attest"]: Refreshing state... [id=app-attest]
github_repository.public["personal-infra"]: Refreshing state... [id=personal-infra]
github_repository.public["Cards"]: Refreshing state... [id=Cards]
github_repository.public["Conferences"]: Refreshing state... [id=Conferences]
github_repository.public["googleplay-go"]: Refreshing state... [id=googleplay-go]
github_repository.public["Choose"]: Refreshing state... [id=Choose]
github_repository.public["Capture"]: Refreshing state... [id=Capture]
github_repository.public["Versioning"]: Refreshing state... [id=Versioning]
github_repository.public["Crescendo"]: Refreshing state... [id=Crescendo]
google_iam_workload_identity_pool.provider: Refreshing state... [id=projects/seraphic-elixir-305011/locations/global/workloadIdentityPools/terraform-provider-googleplay]
google_service_account.provider: Refreshing state... [id=projects/seraphic-elixir-305011/serviceAccounts/terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
data.google_billing_account.default: Reading...
data.google_organization.default: Reading...
googleplay_user.provider: Refreshing state... [name=developers/5166846112789481453/users/terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
data.google_organization.default: Read complete after 1s [id=organizations/943988285976]
google_project_iam_member.provider["roles/iam.roleViewer"]: Refreshing state... [id=seraphic-elixir-305011/roles/iam.roleViewer/serviceAccount:terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
google_project_iam_member.provider["roles/iam.serviceAccountViewer"]: Refreshing state... [id=seraphic-elixir-305011/roles/iam.serviceAccountViewer/serviceAccount:terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
data.google_billing_account.default: Read complete after 1s [id=016282-310295-698AE7]
google_project_iam_member.provider["roles/iam.workloadIdentityPoolViewer"]: Refreshing state... [id=seraphic-elixir-305011/roles/iam.workloadIdentityPoolViewer/serviceAccount:terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.provider: Refreshing state... [id=projects/seraphic-elixir-305011/locations/global/workloadIdentityPools/terraform-provider-googleplay/providers/github-actions]
google_service_account_iam_member.provider: Refreshing state... [id=projects/seraphic-elixir-305011/serviceAccounts/terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/411628404798/locations/global/workloadIdentityPools/terraform-provider-googleplay/attribute.repository/Oliver-Binns/terraform-provider-googleplay]
google_project.wedding: Refreshing state... [id=projects/obinns-happily-ever-after]
github_branch_protection.public["personal-infra"]: Refreshing state... [id=BPR_kwDOOepWKs4DxXSv]
github_branch_protection.public["app-attest"]: Refreshing state... [id=BPR_kwDONDwFa84DxYEC]
github_branch_protection.public["googleplay-go"]: Refreshing state... [id=BPR_kwDOOGYaGs4DnFfB]
github_branch_protection.public["Capture"]: Refreshing state... [id=BPR_kwDOLQV1yM4Cyc3H]
github_branch_protection.public["Crescendo"]: Refreshing state... [id=BPR_kwDOK-nfKM4Dk1MS]
github_branch_protection.public["Website"]: Refreshing state... [id=BPR_kwDOJFY4-M4CHjvY]
github_branch_protection.public["Cards"]: Refreshing state... [id=BPR_kwDOGuN9tM4CTsSe]
github_branch_protection.public["terraform-provider-googleplay"]: Refreshing state... [id=BPR_kwDOODHYWs4DmTep]
github_branch_protection.public["Choose"]: Refreshing state... [id=BPR_kwDOMJ5lf84DxYAM]
github_branch_protection.public["Versioning"]: Refreshing state... [id=BPR_kwDOKqGNBc4CmKn9]
github_branch_protection.public["appstore-go"]: Refreshing state... [id=BPR_kwDOO2LLnM4Dyyfx]
github_branch_protection.public["Conferences"]: Refreshing state... [id=BPR_kwDOIuMSZM4B9Yni]
github_branch_protection.public["terraform-provider-appstore"]: Refreshing state... [id=BPR_kwDOPDAi4s4D2Pcj]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_firebase_project.default will be created
  + resource "google_firebase_project" "default" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = "obinns-happily-ever-after"
      + project_number = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Oliver-Binns, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Infrastructure Updates`*